{
	"introduction": {
		"text": ">An mysterious old man comes by your home with a jaunty stroll, whistling as he goes. He throws a bag at your door, which bounces off and lands on your doorstep. You pick the bag up, feeling three objects inside. Some instructions are printed on the outside: *This is your bag. Use `/bag` to see what it holds.*",
		"next": "levelcheck",
		"randomGive": [
			"Hairball",
			"Fish Hat",
			"Bonsai",
			"Coconut",
			"Mash Season 1",
			"Mash Season 2",
			"Mash Season 3",
			"Mash Season 4",
			"Mash Season 5",
			"Mash Season 6",
			"Mash Season 7",
			"Mash Season 8",
			"Mash Season 9",
			"Mash Season 10",
			"Mash Season 11",
			"1982 Wurlitzer Jukebox",
			"Rice",
			"Crab",
			"Cotten",
			"Mash the Original Novel",
			"Sockmeister Challenge Coin",
			"Cheese",
			"Wheat Seeds",
			"Acorn",
			"Blahaj",
			"Fish",
			"Mash The Complete Series",
			"Cat Hat",
			"Kamina's Shades",
			"Clam",
			"Grass Seeds"
		]
	},
	"levelcheck": {
		"text": "Now, let's see what we're workin' with here. How many thingermajigs do you have in your bag right now? I'll take a peek for ya. Just a sec...",
		"next": "lvl0"
	},
	"lvl0": {
		"text": "Well, shiver me timbers! You're just startin' out, aren't ya? No worries, we all start somewhere. Let's get you up to speed with the basics. First things first, you gotta gather some thingermajigs. Leme give you a hand with that.",
		"give": [
			{
				"name": "Axe",
				"quantity": 4
			},
			{
				"name": "Pickaxe",
				"quantity": 4
			},
			{
				"name": "Shovel",
				"quantity": 4
			}
		],
		"next": "lvl0-1"
	},
	"lvl0-1": {
		"text": "There ye go! I gave you a nice sturdy set of tools to get you started. Now, go gather some wood from <#C06JF3MERUP> and some iron from <#C06KJDF425N> and come back to see me when you're done.",
		"next": "lvl0-2"
	},
	"lvl0-2": {
		"text": "Wait I nearly forgot to tell you how to opperate your tools! Just type `/use axe` or `/use pickaxe` in the chat to gather resources. Easy as pie! You can also check up on how much you've gathered with `/bag me`. Now, go on and gather some resources! I'll be waitin' here for ya.",
		"next": "lvl0-3",
		"pause": true
	},
	"lvl0-3": {
		"text": "Now let's see what you've gathered. You can type `/bag me` in the chat to check your inventory, but i'll just take a peek for now... Hang tight...",
		"check": [
			{
				"resource": "log",
				"quantity": 10,
				"failMessage": "You need to gather more logs! At least {xmore} more hunks."
			},
			{
				"resource": "iron_ore",
				"quantity": 10,
				"failMessage": "You need to gather more iron ore! At least {xmore} more oreos."
			},
			{
				"resource": "rock",
				"quantity": 8,
				"failMessage": "You need to gather more rocks! At least {xmore} more of them. you can find them in <#C06KJCY58GY> where you can use a shovel."
			}
		],
		"next": "lvl0-4"
	},
	"lvl0-4": {
		"text": "Well done! You've gathered enough resources to craft your first item. Type `/item :-furnace:` in the chat to see how to make a furnace. Once you've seen the recipe, type `/craft` followed by the items needed to make it. Once you've crafted the furnace, let me know and i'll tell you about the next piece of bag.",
		"check": [
			{
				"item": "furnace",
				"failMessage": "You need to craft a furnace! Type `/item :-furnace:` to see the recipe."
			}
		],
		"next": "lvl0-5",
		"pause": true
	},
	"lvl0-5": {
		"text": "Well done! You've crafted your first item. Now, let me tell you about the next piece of bag. You can trade with other players by typing `/trade @playername` in the chat. You can also `/give @playername` to give someone stuff from your bag! Now, go on and explore the world of gatherin', craftin', and tradin'!",
		"next": "lvl0-6"
	},
	"lvl0-6": {
		"text": "Well, that's all for now. If you ever need help, just ask one of the other adventurers. They're a friendly bunch, always ready to lend a hand. Oh, and before I forget, here's two little somethin's to get you started on your journey. Good luck out there!\n\nhttps://hackclub.github.io/bag-manifest/",
		"give": [
			{
				"name": "gp",
				"quantity": 85
			}
		],
		"next": "completed"
	}
}
