{
	"introduction": {
		"text": "Ahoy there, young adventurer! The name's Gramps, and let me tell you, I've seen my fair share of curious contraptions in my day. But this bag? This is a beaut! Just landed it on your doorstep, full of surprises. Now, this bag ain't your average sack of potatoes. It's a magic one, filled with the potential for gatherin', craftin', and even tradin' with your fellow explorers! But first things first, gotta learn about your bag!",
		"next": "levelcheck"
	},
	"levelcheck": {
		"text": "Now, let's see what we're workin' with here. How many thingermajigs do you have in your bag right now?",
		"check": [
			{
				"netWorth": 100,
				"opperator": "less",
				"next": "lvl0"
			},
			{
				"netWorth": 500,
				"opperator": "less",
				"next": "lvl1"
			},
			{
				"netWorth": 500,
				"opperator": "greater",
				"next": "lvl2"
			}
		]
	},
	"lvl0": {
		"text": "Well, shiver me timbers! You're just startin' out, aren't ya? No worries, we all start somewhere. Let's get you up to speed with the basics. First things first, you gotta gather some thingermajigs. Leme give you a hand with that.",
		"give": [
			{
				"name": "axe",
				"quantity": 10
			},
			{
				"name": "pickaxe",
				"quantity": 10
			}
		],
		"next": "lvl0-1"
	},
	"lvl0-1": {
		"text": "There ye go! I gave you a nice sturdy set of tools to get you started. Now, go gather some wood from <#C06JF3MERUP> and some iron from <#C06KJDF425N> and come back to see me when you're done.",
		"next": "lvl0-2"
	},
	"lvl0-2": {
		"text": "Wait I nearly forgot to tell you how to opperate your tools! Just type `/use axe` or `/use pickaxe` in the chat to gather resources. Easy as pie! You can also check up on how much you've gathered with `/bag me`. Now, go on and gather some resources!",
		"next": "lvl0-3"
	},
	"lvl0-3": {
		"text": "Now let's see what you've gathered. You can type `/bag me` in the chat to check your inventory, but i'll just take a peek for now...",
		"check": [
			{
				"resource": "wood",
				"quantity": 10,
				"failMessage": "You need to gather more wood! At least 10 pieces."
			},
			{
				"resource": "iron",
				"quantity": 10,
				"failMessage": "You need to gather more iron! At least 10 pieces."
			},
			{
				"resource": "stone",
				"quantity": 8,
				"failMessage": "You need to gather more stone! At least 8 pieces."
			}
		],
		"next": "lvl0-4"
	},
	"lvl0-4": {
		"text": "Well done! You've gathered enough resources to craft your first item. Type `/item :-furnace:` in the chat to see how to make a furnace. Once you've seen the recipe, type `/craft` followed by the items needede to make it. Once you've crafted the furnace, let me know and i'll tell you about the next piece of bag.",
		"check": [
			{
				"item": "furnace",
				"failMessage": "You need to craft a furnace! Type `/item :-furnace:` to see the recipe."
			}
		],
		"next": "lvl0-5"
	},
	"lvl0-5": {
		"text": "Well done! You've crafted your first item. Now, let me tell you about the next piece of bag. You can trade with other players by typing `/trade @playername` in the chat. You can also `/give @playername` to give someone stuff from your bag! Now, go on and explore the world of gatherin', craftin', and tradin'!",
		"next": "lvl0-6"
	},
	"lvl0-6": {
		"text": "Well, that's all for now. If you ever need help, just ask one of the other adventurers. They're a friendly bunch, always ready to lend a hand. Oh, and before I forget, here's two little somethin's to get you started on your journey. Good luck out there!\n\nhttps://hackclub.github.io/bag-manifest/",
		"give": [
			{
				"name": "gp",
				"quantity": 85
			}
		],
		"next": "completed"
	},
	"lvl1": {
		"text": "Well, shiver me timbers! You've already been doing some huntin' and gatherin', haven't ya? Good on ya! Now, let's see if you're ready for the next level. I'll give you a hand with that.",
		"next": "lvl1-1"
	},
	"lvl1-1": {
		"text": "I see you've been gatherin' resources, but have you tried craftin' anything yet? Since you're already familiar with the basics, I'll just give you der basics; to find out how to craft an item, type `/item :-itemname:` in the chat. Once you've seen the recipe, type `/craft` followed by the items needed to make it.",
		"next": "lvl1-2"
	},
	"lvl1-2": {
		"text": "Now, let's see what you have in your bag. You can type `/bag me` in the chat to check your inventory.",
		"next": "lvl1-3"
	},
	"lvl1-3": {
		"text": "Well well well, lookee here! You have quite the collection of resources in your bag. Now, let's / refresh you on how to trade with other players.\n\nTraden with other's is really quite simple. Just type `/trade @playername` in the chat to start a trade. You can also `/give @playername` to give them a little smthn from your bag! Now, go on and explore the world of gatherin', craftin', and tradin'!",
		"next": "lvl1-4"
	},
	"lvl1-4": {
		"text": "Well, that's all for now. If you ever need help, just ask one of the other adventurers. They're a friendly bunch, always ready to lend a hand. Oh, and before I forget, here's a little somethin' to get you started on your journey. Good luck out there!\n\nhttps://hackclub.github.io/bag-manifest/",
		"give": [
			{
				"name": "gp",
				"quantity": 85
			}
		],
		"next": "completed"
	},
	"lvl2": {
		"text": "Well, shiver me timbers! You're quite the seasoned adventurer, aren't ya? You've been gatherin', craftin', and tradin' like a pro! Now, leme just give you the quick rundown to make sure you know all the bells and whistles of this here shiny, {puasee, :thincc:} well i do believe it ain't shiny no more, you get the point though.",
		"next": "lvl2-1"
	},
	"lvl2-1": {
		"text": "Now, let's see what you have in your bag. You can type `/bag me` in the chat to check your inventory.",
		"next": "lvl2-2"
	},
	"lvl2-2": {
		"text": "Well well well, lookee here! You have quite the collection of resources in your bag. Now, let's refresh you on how to trade with other players.\n\nTraden with other's is really quite simple. Just type `/trade @playername` in the chat to start a trade. You can also `/give @playername` to give them a little smthn from your bag! Now, go on and explore the world of gatherin', craftin', and tradin'!",
		"next": "lvl2-3"
	},
	"lvl2-3": {
		"text": "Well, that's all for now. If you ever need help, just ask one of the other adventurers. They're a friendly bunch, always ready to lend a hand. Oh, and before I forget, here's a little somethin' to keep you a-going on your journey. Good luck out there traveler!\n\nhttps://hackclub.github.io/bag-manifest/",
		"give": [
			{
				"name": "gp",
				"quantity": 65
			}
		],
		"next": "completed"
	}
}
